Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_mdma.h
// C13DAR Configuration

#define MDMA_C13DAR_DAR         (0xFFFFFFFFU<<0)
#define MDMA_C13DAR_DAR_0       (0x1U<<0)

// C13BRUR Configuration

#define MDMA_C13BRUR_DUV        (0xFFFFU<<16)
#define MDMA_C13BRUR_DUV_0      (0x1U<<16)
#define MDMA_C13BRUR_SUV        (0xFFFFU<<0)
#define MDMA_C13BRUR_SUV_0      (0x1U<<0)

// C13LAR Configuration

#define MDMA_C13LAR_LAR         (0xFFFFFFFFU<<0)
#define MDMA_C13LAR_LAR_0       (0x1U<<0)

// C13TBR Configuration

#define MDMA_C13TBR_DBUS        (0x1U<<17)
#define MDMA_C13TBR_SBUS        (0x1U<<16)
#define MDMA_C13TBR_TSEL        (0x3FU<<0)
#define MDMA_C13TBR_TSEL_0      (0x1U<<0)

// C13MAR Configuration

#define MDMA_C13MAR_MAR         (0xFFFFFFFFU<<0)
#define MDMA_C13MAR_MAR_0       (0x1U<<0)

// C13MDR Configuration

#define MDMA_C13MDR_MDR         (0xFFFFFFFFU<<0)
#define MDMA_C13MDR_MDR_0       (0x1U<<0)

// C14ISR Configuration

#define MDMA_C14ISR_CRQA14      (0x1U<<16)
#define MDMA_C14ISR_TCIF14      (0x1U<<4)
#define MDMA_C14ISR_BTIF14      (0x1U<<3)
#define MDMA_C14ISR_BRTIF14     (0x1U<<2)
#define MDMA_C14ISR_CTCIF14     (0x1U<<1)
#define MDMA_C14ISR_TEIF14      (0x1U<<0)

// C14IFCR Configuration

#define MDMA_C14IFCR_CLTCIF14   (0x1U<<4)
#define MDMA_C14IFCR_CBTIF14    (0x1U<<3)
#define MDMA_C14IFCR_CBRTIF14   (0x1U<<2)
#define MDMA_C14IFCR_CCTCIF14   (0x1U<<1)
#define MDMA_C14IFCR_CTEIF14    (0x1U<<0)

// C14ESR Configuration

#define MDMA_C14ESR_BSE         (0x1U<<11)
#define MDMA_C14ESR_ASE         (0x1U<<10)
#define MDMA_C14ESR_TEMD        (0x1U<<9)
#define MDMA_C14ESR_TELD        (0x1U<<8)
#define MDMA_C14ESR_TED         (0x1U<<7)
#define MDMA_C14ESR_TEA         (0x7FU<<0)
#define MDMA_C14ESR_TEA_0       (0x1U<<0)

// C14CR Configuration

#define MDMA_C14CR_SWRQ         (0x1U<<16)
#define MDMA_C14CR_WEX          (0x1U<<14)
#define MDMA_C14CR_HEX          (0x1U<<13)
#define MDMA_C14CR_BEX          (0x1U<<12)
#define MDMA_C14CR_PL           (0x3U<<6)
#define MDMA_C14CR_PL_0         (0x1U<<6)
#define MDMA_C14CR_TCIE         (0x1U<<5)
#define MDMA_C14CR_BTIE         (0x1U<<4)
#define MDMA_C14CR_BRTIE        (0x1U<<3)
#define MDMA_C14CR_CTCIE        (0x1U<<2)
#define MDMA_C14CR_TEIE         (0x1U<<1)
#define MDMA_C14CR_EN           (0x1U<<0)

// C14TCR Configuration

#define MDMA_C14TCR_BWM         (0x1U<<31)
#define MDMA_C14TCR_SWRM        (0x1U<<30)
#define MDMA_C14TCR_TRGM        (0x3U<<28)
#define MDMA_C14TCR_TRGM_0      (0x1U<<28)
#define MDMA_C14TCR_PAM         (0x3U<<26)
#define MDMA_C14TCR_PAM_0       (0x1U<<26)
#define MDMA_C14TCR_PKE         (0x1U<<25)
#define MDMA_C14TCR_TLEN        (0x7FU<<18)
#define MDMA_C14TCR_TLEN_0      (0x1U<<18)
#define MDMA_C14TCR_DBURST      (0x7U<<15)
#define MDMA_C14TCR_DBURST_0    (0x1U<<15)
#define MDMA_C14TCR_SBURST      (0x7U<<12)
#define MDMA_C14TCR_SBURST_0    (0x1U<<12)
#define MDMA_C14TCR_DINCOS      (0x3U<<10)
#define MDMA_C14TCR_DINCOS_0    (0x1U<<10)
#define MDMA_C14TCR_SINCOS      (0x3U<<8)
#define MDMA_C14TCR_SINCOS_0    (0x1U<<8)
#define MDMA_C14TCR_DSIZE       (0x3U<<6)
#define MDMA_C14TCR_DSIZE_0     (0x1U<<6)
#define MDMA_C14TCR_SSIZE       (0x3U<<4)
#define MDMA_C14TCR_SSIZE_0     (0x1U<<4)
#define MDMA_C14TCR_DINC        (0x3U<<2)
#define MDMA_C14TCR_DINC_0      (0x1U<<2)
#define MDMA_C14TCR_SINC        (0x3U<<0)
#define MDMA_C14TCR_SINC_0      (0x1U<<0)

// C14BNDTR Configuration

#define MDMA_C14BNDTR_BRC       (0xFFFU<<20)
#define MDMA_C14BNDTR_BRC_0     (0x1U<<20)
#define MDMA_C14BNDTR_BRDUM     (0x1U<<19)
#define MDMA_C14BNDTR_BRSUM     (0x1U<<18)
#define MDMA_C14BNDTR_BNDT      (0x1FFFFU<<0)
#define MDMA_C14BNDTR_BNDT_0    (0x1U<<0)

// C14SAR Configuration

#define MDMA_C14SAR_SAR         (0xFFFFFFFFU<<0)
#define MDMA_C14SAR_SAR_0       (0x1U<<0)

// C14DAR Configuration

#define MDMA_C14DAR_DAR         (0xFFFFFFFFU<<0)
#define MDMA_C14DAR_DAR_0       (0x1U<<0)

// C14BRUR Configuration

#define MDMA_C14BRUR_DUV        (0xFFFFU<<16)
#define MDMA_C14BRUR_DUV_0      (0x1U<<16)
#define MDMA_C14BRUR_SUV        (0xFFFFU<<0)
#define MDMA_C14BRUR_SUV_0      (0x1U<<0)

// C14LAR Configuration

#define MDMA_C14LAR_LAR         (0xFFFFFFFFU<<0)
#define MDMA_C14LAR_LAR_0       (0x1U<<0)

// C14TBR Configuration

#define MDMA_C14TBR_DBUS        (0x1U<<17)
#define MDMA_C14TBR_SBUS        (0x1U<<16)
#define MDMA_C14TBR_TSEL        (0x3FU<<0)
#define MDMA_C14TBR_TSEL_0      (0x1U<<0)

// C14MAR Configuration

#define MDMA_C14MAR_MAR         (0xFFFFFFFFU<<0)
#define MDMA_C14MAR_MAR_0       (0x1U<<0)

// C14MDR Configuration

#define MDMA_C14MDR_MDR         (0xFFFFFFFFU<<0)
#define MDMA_C14MDR_MDR_0       (0x1U<<0)

// C15ISR Configuration

#define MDMA_C15ISR_CRQA15      (0x1U<<16)
#define MDMA_C15ISR_TCIF15      (0x1U<<4)
#define MDMA_C15ISR_BTIF15      (0x1U<<3)
#define MDMA_C15ISR_BRTIF15     (0x1U<<2)
#define MDMA_C15ISR_CTCIF15     (0x1U<<1)
#define MDMA_C15ISR_TEIF15      (0x1U<<0)

// C15IFCR Configuration

#define MDMA_C15IFCR_CLTCIF15   (0x1U<<4)
#define MDMA_C15IFCR_CBTIF15    (0x1U<<3)
#define MDMA_C15IFCR_CBRTIF15   (0x1U<<2)
#define MDMA_C15IFCR_CCTCIF15   (0x1U<<1)
#define MDMA_C15IFCR_CTEIF15    (0x1U<<0)

// C15ESR Configuration

#define MDMA_C15ESR_BSE         (0x1U<<11)
#define MDMA_C15ESR_ASE         (0x1U<<10)
#define MDMA_C15ESR_TEMD        (0x1U<<9)
#define MDMA_C15ESR_TELD        (0x1U<<8)
#define MDMA_C15ESR_TED         (0x1U<<7)
#define MDMA_C15ESR_TEA         (0x7FU<<0)
#define MDMA_C15ESR_TEA_0       (0x1U<<0)

// C15CR Configuration

#define MDMA_C15CR_SWRQ         (0x1U<<16)
#define MDMA_C15CR_WEX          (0x1U<<14)
#define MDMA_C15CR_HEX          (0x1U<<13)
#define MDMA_C15CR_BEX          (0x1U<<12)
#define MDMA_C15CR_PL           (0x3U<<6)
#define MDMA_C15CR_PL_0         (0x1U<<6)
#define MDMA_C15CR_TCIE         (0x1U<<5)
#define MDMA_C15CR_BTIE         (0x1U<<4)
#define MDMA_C15CR_BRTIE        (0x1U<<3)
#define MDMA_C15CR_CTCIE        (0x1U<<2)
#define MDMA_C15CR_TEIE         (0x1U<<1)
#define MDMA_C15CR_EN           (0x1U<<0)

// C15TCR Configuration

#define MDMA_C15TCR_BWM         (0x1U<<31)
#define MDMA_C15TCR_SWRM        (0x1U<<30)
#define MDMA_C15TCR_TRGM        (0x3U<<28)
#define MDMA_C15TCR_TRGM_0      (0x1U<<28)
#define MDMA_C15TCR_PAM         (0x3U<<26)
#define MDMA_C15TCR_PAM_0       (0x1U<<26)
#define MDMA_C15TCR_PKE         (0x1U<<25)
#define MDMA_C15TCR_TLEN        (0x7FU<<18)
#define MDMA_C15TCR_TLEN_0      (0x1U<<18)
#define MDMA_C15TCR_DBURST      (0x7U<<15)
#define MDMA_C15TCR_DBURST_0    (0x1U<<15)
#define MDMA_C15TCR_SBURST      (0x7U<<12)
#define MDMA_C15TCR_SBURST_0    (0x1U<<12)
#define MDMA_C15TCR_DINCOS      (0x3U<<10)
#define MDMA_C15TCR_DINCOS_0    (0x1U<<10)
#define MDMA_C15TCR_SINCOS      (0x3U<<8)
#define MDMA_C15TCR_SINCOS_0    (0x1U<<8)
#define MDMA_C15TCR_DSIZE       (0x3U<<6)
#define MDMA_C15TCR_DSIZE_0     (0x1U<<6)
#define MDMA_C15TCR_SSIZE       (0x3U<<4)
#define MDMA_C15TCR_SSIZE_0     (0x1U<<4)
#define MDMA_C15TCR_DINC        (0x3U<<2)
#define MDMA_C15TCR_DINC_0      (0x1U<<2)
#define MDMA_C15TCR_SINC        (0x3U<<0)
#define MDMA_C15TCR_SINC_0      (0x1U<<0)

// C15BNDTR Configuration

#define MDMA_C15BNDTR_BRC       (0xFFFU<<20)
#define MDMA_C15BNDTR_BRC_0     (0x1U<<20)
#define MDMA_C15BNDTR_BRDUM     (0x1U<<19)
#define MDMA_C15BNDTR_BRSUM     (0x1U<<18)
#define MDMA_C15BNDTR_BNDT      (0x1FFFFU<<0)
#define MDMA_C15BNDTR_BNDT_0    (0x1U<<0)

// C15SAR Configuration

#define MDMA_C15SAR_SAR         (0xFFFFFFFFU<<0)
#define MDMA_C15SAR_SAR_0       (0x1U<<0)

// C15DAR Configuration

#define MDMA_C15DAR_DAR         (0xFFFFFFFFU<<0)
#define MDMA_C15DAR_DAR_0       (0x1U<<0)

// C15BRUR Configuration

#define MDMA_C15BRUR_DUV        (0xFFFFU<<16)
#define MDMA_C15BRUR_DUV_0      (0x1U<<16)
#define MDMA_C15BRUR_SUV        (0xFFFFU<<0)
#define MDMA_C15BRUR_SUV_0      (0x1U<<0)

// C15LAR Configuration

#define MDMA_C15LAR_LAR         (0xFFFFFFFFU<<0)
#define MDMA_C15LAR_LAR_0       (0x1U<<0)

// C15TBR Configuration

#define MDMA_C15TBR_DBUS        (0x1U<<17)
#define MDMA_C15TBR_SBUS        (0x1U<<16)
#define MDMA_C15TBR_TSEL        (0x3FU<<0)
#define MDMA_C15TBR_TSEL_0      (0x1U<<0)

// C15MAR Configuration

#define MDMA_C15MAR_MAR         (0xFFFFFFFFU<<0)
#define MDMA_C15MAR_MAR_0       (0x1U<<0)

// C15MDR Configuration

#define MDMA_C15MDR_MDR         (0xFFFFFFFFU<<0)
#define MDMA_C15MDR_MDR_0       (0x1U<<0)
